{
    "object_type": "IWPR",
    "object_name": "SAP Gateway Business Suite Enablement - OData Service Builder Project",
    "tcode": "SEGW",
    "description": "IWPR refers to SAP Gateway OData projects created using the Service Builder. OData is a web protocol that allows for querying and updating SAP data using ABAP and modern web technologies like HTTP. These services are often consumed by external applications, platforms, and devices for integration with SAP systems.",
    "components": {
        "Data_Model": [
            "Entity Types",
            "Entity Sets",
            "Associations",
            "Association Sets",
            "Complex Types",
            "Model References (excluded during retrofit)"
        ],
        "Service_Implementation": [
            "DPC Class (Data Provider Class)",
            "MPC Class (Model Provider Class)"
        ],
        "Runtime_Artifacts": [
            "Metadata document",
            "Model classes",
            "Generated classes"
        ],
        "Service_Maintenance": [
            "System alias configuration",
            "Service registration and activation"
        ]
    },
    "usage": {
        "basic": [
            "Create and expose RESTful services using ABAP backend.",
            "Used for integrating SAP data with external applications via OData protocol.",
            "Built using transaction code SEGW."
        ],
        "advanced": [
            "Customize data models and implement service operations in DPC/MPC classes.",
            "Enhance services to handle business logic.",
            "Ensure version consistency during dual maintenance (retrofit)."
        ]
    },
    "retrofit_process": {
        "pre_checks": [
            "IWPR objects are not safe to import directly.",
            "Scoping utility does not indicate NEW/EXISTING status.",
            "Manually check object existence in target system using SEGW.",
            "Use SE03 to check version history in source and target systems."
        ],
        "step_by_step": [
            "Login to SAP system in original language of the project.",
            "Open the project using SEGW in both source and target systems.",
            "Expand 'Data Model' (excluding Model References).",
            "Compare ALVs for Entity Types using Meld/WINmerge.",
            "Copy new changes (e.g., additional properties/entities) from source to target.",
            "Check and compare: Properties, Navigation, Complex Types, Associations, Entity Sets.",
            "Do not manually modify DPC or MPC classes — only compare versions using SE03.",
            "Regenerate project after applying changes.",
            "Resolve generation errors related to missing ABAP fields (e.g., caused by imported structures).",
            "Verify service runtime artifacts regeneration succeeded."
        ],
        "version_validation": [
            "Use SE03 to identify latest TRs and customer changes.",
            "If changes exist in target but not in source, confirm if they are intended.",
            "Check DPC/MPC class method versions (e.g., UNITOFMEASURESET_UPDATE_ENTITY)."
        ],
        "tools": [
            "SEGW (Gateway Builder)",
            "SE03 (Version Check)",
            "Meld / WinMerge (ALV comparison)"
        ]
    },
    "important_notes": [
        "Work in original language to ensure labels are maintained.",
        "Do not overwrite customer changes in the target system.",
        "Do not make manual changes to DPC/MPC classes.",
        "Regenerate after structure retrofits to avoid ABAP field errors."
    ],
    "supporting_object_types": {
        "IWSV": "Service Registration",
        "IWMO": "Model",
        "IWOM": "Model Metadata",
        "IWSG": "Service Grouping",
        "note": "Only NEW entries for these objects should be imported via ToC. Not safe to import."
    },
    "chatbot_answers": {
        "What is IWPR?": "IWPR refers to an OData project created using SAP Gateway Service Builder (Tcode SEGW). It's used to expose SAP backend data as RESTful services that external applications can consume.",
        "What is the tcode for IWPR?": "SEGW is the transaction code used to access and modify IWPR projects.",
        "What are the components of IWPR?": "The main components include Data Model (Entity Types, Entity Sets, Associations, Complex Types), Service Implementation (DPC/MPC classes), Runtime Artifacts, and Service Maintenance.",
        "What to check during IWPR retrofit?": "Verify existence using SEGW, check version info using SE03, compare data model subcomponents (except model references), regenerate project after copying source changes, and ensure DPC/MPC methods are not manually changed.",
        "How to handle errors during IWPR generation?": "If you get ABAP field-related errors, ensure the structure used in the entity type is also retrofitted. Then regenerate the project.",
        "What are the supporting object types for IWPR?": "IWSV, IWMO, IWOM, and IWSG are supporting object types. Only NEW entries should be imported via ToC.",
        "How to compare changes during IWPR retrofit?": "Use SEGW to open the project in source and target, copy ALVs and compare using Meld or WinMerge. Do this for Entity Types, Complex Types, Associations, and Entity Sets.",
        "Why is original language important in IWPR?": "Because labels entered will only reflect in the REPT if the original language is used."
    }
}