{
  "object type": "PROG",
  "description": {
    "definition": "PROG refers to ABAP Program objects created via transaction SE38. In SAP transport terminology, an R3TR-PROG entry represents the complete program including its sub-objects such as Includes (REPS), Text Elements (REPT), Screens (DYNP), GUI Status/Menu (CUAD), and Documentation (DOCU).",
    "format_in_scope": "R3TR-PROG-ProgramName",
    "can_be_included_in_toc_analysis": {
      "NEW": {
        "allowed": true,
        "notes": "For NEW objects within scope (Scope = IN), the entire PROG object can be included in ToC import. After import, tool rules must be applied to all sub-objects using retrofit utilities."
      },
      "EXISTING": {
        "allowed": false,
        "notes": "For EXISTING objects, PROG entries cannot be directly included in ToC import. Retrofit must be performed using Tool Scope logic."
      }
    },
    "sub_objects": [
      "REPS",
      "REPT",
      "DYNP",
      "CUAD",
      "DOCU"
    ],
    "retrofit_scope_handling": {
      "tool_scope": {
        "description": "Sub-object type REPS (e.g., Includes like TOP, F01, I01, O01) is handled under Tool Scope. Tool Scope entries must be retrofitted using the results of parsed source, merged, and target files."
      },
      "service_scope": {
        "description": "Sub-objects like REPT (Text elements), DYNP (Screens), CUAD (GUI Status/Menu), and DOCU (Documentation) are handled under Service Scope. These must be retrofitted if not already covered."
      }
    },
    "filtering_and_duplicate_handling": {
      "example": "scope = IN, MAIN_OBJECT = '/SCL/RDLETRAR_DRIVER_SW'",
      "steps": [
        "Apply filter on scoping sheet using Scope = IN and MAIN_OBJECT = specific program name.",
        "Remove duplicate entries by checking column 'Duplicate'.",
        "Retain only the latest transport with 'Final' or blank status and discard older duplicates."
      ]
    },
    "guidelines": {
      "service_scope_check": "Ensure Service Scope sub-objects are already retrofitted. If not, handle them separately.",
      "final_vs_blank": "When both FINAL and BLANK entries exist, use the latest transport request based on version history and mark the older one as 'Retrofit Done' or 'No Action'.",
      "tool_usage": "Use tool-generated files (source_parsed, merged, target) along with version history to determine retrofitted code structure.",
      "version_checking": "Use SE03 -> E071/E070 to check latest version of the transport object."
    },
    "rssyscomp_utility": {
      "description": "To retrieve all sub-objects of R3TR-PROG entry, run report RSSYSCOMP with the program name.",
      "output_usage": "Use PROGRAM_ID, OBJECT_TYPE, OBJ_NAME columns in output to verify all LIMU sub-objects needing retrofit.",
      "scoping_sheet_application": "Filter the scoping sheet with same MAIN_OBJECT and remove duplicates before proceeding."
    },
    "priority_note": "Always begin retrofit for R3TR-PROG entries before working on individual LIMUs to ensure dependent objects with different scope TRs are also covered.",
    "note": "Handling difference for Online and Offline retrofit of PROG objects is pending (to be documented separately)."
  },
  "tcode": "SE38",
  "tool_used": [
    "Retrofit Tool Dashboard",
    "RSSYSCOMP",
    "SE03",
    "E071",
    "E070",
    "Excel",
    "Source_Parsed/Merged/Target files"
  ],
  "retrofit_process": {
    "new_object": {
      "description": "If PROG is new to the target system, it can be imported via dashboard (online retrofit) or ToC import (offline retrofit).",
      "steps": [
        "If scope TR has NEW R3TR PROG, all sub-objects (REPT, REPS, DYNP, CUAD) are included in import.",
        "If scope TR has only LIMU REPS (e.g., /SCL/RDLETRAR_DRIVER_SWTOP), only that include is imported.",
        "Post-import, if Tool Scope changes exist, apply parsed/merged tool result on top."
      ]
    },
    "existing_object": {
      "description": "If PROG exists in the target, it must be retrofitted using tool results (source_parsed, merged, target files).",
      "steps": [
        "If scope TR has LIMU REPS, retrofit that sub-object only.",
        "If scope TR has R3TR PROG, all sub-objects need to be retrofitted.",
        "Use version comparison (SE03/E071/E070) to validate latest scope TR."
      ]
    }
  },
  "comparison notes": {
    "tool_scope_vs_service_scope": "Tool Scope (REPS) relies on parsed/merged tool files. Service Scope (REPT, DYNP, CUAD, DOCU) must be validated for manual retrofit.",
    "version_checking": "SE03 → E071 or E070 comparison recommended before importing R3TR PROG objects."
  },
  "common_errors": [
    "Directly including EXISTING R3TR PROG in ToC — not allowed.",
    "Forgetting to check if REPT/DYNP/CUAD are already retrofitted.",
    "Working on LIMU before PROG — breaks dependency handling.",
    "Missing duplicate removal or importing older TR due to 'Blank' status misunderstanding."
  ],
  "best_practices": [
    "Always handle R3TR PROG before LIMU sub-objects.",
    "Check version history of TRs in SE03 to decide FINAL vs BLANK handling.",
    "Run RSSYSCOMP to get all LIMUs for PROG before retrofit.",
    "Use parsed/merged output for REPS and verify merged correctness before applying.",
    "Keep functional team in loop for REPT/DYNP/CUAD related Service Scope elements."
  ],
  "chatbot_responses": {
    "faq_short": "PROG represents an ABAP Program and includes all sub-objects like REPS, REPT, DYNP, CUAD, and DOCU. It must be carefully handled during retrofit depending on whether it's NEW or EXISTING.",
    "faq_detailed": "The PROG object type refers to ABAP programs in SAP. If it’s new, you can import it via ToC or Retrofit Dashboard, and it includes all sub-objects. For existing ones, you must use parsed/merged tool files and follow scope-specific logic. Always use RSSYSCOMP to fetch related sub-objects, and prioritize handling R3TR-PROG before LIMUs. Errors occur if you miss version check or include old duplicates."
  }
}
